;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;  File : QuickConfigLang.ini
;;  Version 1.0
;;  This int file contains the strings that gets displayed in QuickConfig utility
;;  (c) Copyright - 2008
;;  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Instructions to add the support for any new language:
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; If you want to add any additional language support, add a section with that System Language Identifier.
; 1. Section name should be System Language Id specified with in []. 
; A table is mentioned at the end of this file which has various System Language ID's.
; Ex: [0x0411] which adds the support of Japanese language.

; 2. Add a key with the same language id and specify the key value as the language as specified in the table.
; Ex:0x0411=Japanese
; Place all your Japanese translated strings under this section with the same key names as specified in English.
;-----------------------------------------------------------------------------------------------------



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[0x0409]
0x0409=English (United States)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;-----------------------------------------------------------------------------------------------------
;Dialog controls related static text strings.(resource id related)
;-----------------------------------------------------------------------------------------------------
APPLICATION_TITLE		= USB-Server Quick Configuration Utility
;Search server related strings.
;-----------------------------------------------------------------------------------------------------
IDC_STATIC_WELCOME		= Welcome to USB Server Setup
IDC_SEARCHPAGE_STATIC1		= To configure your USB Server please make sure the following things.
IDC_SEARCHPAGE_STATIC2		= 1) USB Server is connected to LAN.
IDC_SEARCHPAGE_STATIC3		= 2) USB Server is powered on.
IDC_STATIC_SERVERS		= Search for USB Servers
IDC_SEARCHPAGE_STATIC4		= Select an entry from search results (or) Enter Mac address of USB Server to configure.
IDC_STATIC_SEARCHRSLT_BOX	= Search Results
IDC_STATIC_BOX_COL1		= S.No
IDC_STATIC_BOX_COL2		= Server Name
IDC_STATIC_BOX_COL3		= MAC Address
IDC_STATIC_BOX_COL4		= IP Address
IDC_STATIC_MACADDR_BOX		= USB Server to Configure 


;Network Settings page related strings.
;-----------------------------------------------------------------------------------------------------
IDC_STATIC_SVRSET		= Server Settings
IDC_STATIC_MODE_BOX		= Mode
IDC_NWPAGE_STATIC1		= Select DHCP for IP to be assigned by a DHCP Server.
IDC_NWPAGE_STATIC2		= Select Static to assign IP details manually.
IDC_NW_SETINGS_BOX		= Network Settings 
IDC_SERVER_NAME_BOX		= Server Name 
IDC_STATIC_FLASH		= ProgressBar
IDC_STATIC_FINISH_FLASH		= Progressing ...
IDC_SERVERNAME_CHK		= Modify

;-----------------------------------------------------------------------------------------------------
;AfxMessageBox related strings.(Info or Error messages)
;-----------------------------------------------------------------------------------------------------
;Search Server Page related strings.(prompt messages boxes)
;-----------------------------------------------------------------------------------------------------
;Message Box Title string
MODULE_NAME	 	= QuickConfig Utility
;Windows firewall related prompt message box displayed when the application is launched.
IDS_MSG_FIREWALL	= When using this application, it needs to be added to the exceptions list of the windows firewall. \nDo you want to add this application to the exceptions list?

IDS_NOITEM_SELECT	= Select any item from the List Box or Enter the MacId
IDS_INVALID_MACADDR	= Invalid MAC address
IDS_MACIDSEARCH_FAILED	= No Server Found with this MacId
IDS_MACID_HEX_ERR	= MAC Address should be in HexaDecimals

;-----------------------------------------------------------------------------------------------------
;Network Settings page related strings.(prompt messages boxes)
;-----------------------------------------------------------------------------------------------------
IDS_ON_UPGRAGE		= Press 'Yes' to save the settings
IDS_UPGRADE_SUCCESS	= Successfully configured the USB Server
IDS_UPGRADE_FAILED	= Failed to Configure the USB Server
IDS_NWSERDETAILS_ERR	= Enter valid Network Details and Server Name
IDS_SERVERNAME_ERR	= Enter valid Server Name
IDS_NWDETAILS_ERR	= Enter valid Network Details



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Table of Language Identifiers
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;Identifier 		Language 
;-----------------------------------------------------------------------------------------------------

;0x0404 		Chinese (Taiwan) 
;0x0804 		Chinese (PRC) 
;0x0c04 		Chinese (Hong Kong SAR, PRC) 
;0x1004 		Chinese (Singapore) 
;0x0409 		English (United States) 
;0x0809 		English (United Kingdom) 
;0x0c09 		English (Australian) 
;0x1009 		English (Canadian) 
;0x1409 		English (New Zealand) 
;0x1809 		English (Ireland) 
;0x1c09 		English (South Africa) 
;0x2009 		English (Jamaica) 
;0x2409 		English (Caribbean) 
;0x2809 		English (Belize) 
;0x2c09 		English (Trinidad) 
;0x040c 		French (Standard) 
;0x080c 		French (Belgian) 
;0x0c0c 		French (Canadian) 
;0x100c 		French (Switzerland) 
;0x140c 		French (Luxembourg) 
;0x0407 		German (Standard) 
;0x0807 		German (Switzerland) 
;0x0c07 		German (Austria) 
;0x1007 		German (Luxembourg) 
;0x1407 		German (Liechtenstein) 
;0x0421 		Indonesian 
;0x0410 		Italian (Standard) 
;0x0810 		Italian (Switzerland) 
;0x0411 		Japanese 
;0x0412 		Korean 
;0x0414 		Norwegian (Bokmal) 
;0x0814 		Norwegian (Nynorsk) 
;0x0415 		Polish 
;0x0416 		Portuguese (Brazil) 
;0x0816 		Portuguese (Portugal) 
;0x0418 		Romanian 
;0x0419 		Russian 
;0x040a 		Spanish (Spain, Traditional Sort) 
;0x080a 		Spanish (Mexican) 
;0x0c0a 		Spanish (Spain, Modern Sort) 
;0x100a 		Spanish (Guatemala) 
;0x140a 		Spanish (Costa Rica) 
;0x180a 		Spanish (Panama) 
;0x1c0a 		Spanish (Dominican Republic) 
;0x200a 		Spanish (Venezuela) 
;0x240a 		Spanish (Colombia) 
;0x280a 		Spanish (Peru) 
;0x2c0a 		Spanish (Argentina) 
;0x300a 		Spanish (Ecuador) 
;0x340a 		Spanish (Chile) 
;0x380a 		Spanish (Uruguay) 
;0x3c0a 		Spanish (Paraguay) 
;0x400a 		Spanish (Bolivia) 
;0x440a 		Spanish (El Salvador) 
;0x480a 		Spanish (Honduras) 
;0x4c0a 		Spanish (Nicaragua) 
;0x500a 		Spanish (Puerto Rico) 
;0x041d 		Swedish 
;0x081d 		Swedish (Finland) 
;0x041e 		Thai 
;0x0452 		Welsh (United Kingdom)
